## Тестовое задание для кандидатов "Аналитик Стажер python"
## Максимов С.К.




## Задание 1: Имена

### Исходные данные

### Задача

Нужно выполнить следующие действия и вывести результат вычислений:

1. Отсортировать все имена в лексикографическом порядке.
2. Посчитать для каждого имени алфавитную сумму – сумму порядковых номеров букв (MAY: 13 + 1 + 25 = 39).
3. Умножить алфавитную сумму каждого имени на порядковый номер имени в отсортированном списке (индексация начинается с 1). Например, если MAY находится на 63 месте в списке, то результат для него будет 63 * 39 = 2457.
4. Сложить произведения из п. 3 для всех имен из файла и получить число.
5. Вывести полученную сумму.

## Задание 2: IP-адреса

### Исходные данные

Файл состоит из строк вида: `<host>\t<ip>\t<page>\n`, где host — корневой домен, ip — IP-адрес, page — «хвост» ссылки.

### Задача

Необходимо вывести 5 IP-адресов, которые встречаются в файле чаще других.
## Задание 3: Оценка уроков

*В нашей школе ученики и репетиторы занимаются в специальном онлайн-классе, в котором они могут общаться друг с другом, рисовать на доске, переписываться в чате, обмениваться файлами и решать различные задачки. Информацию о каждом уроке мы записываем в базу данных в таблицу lessons. На каждом таком уроке присутствует один репетитор и один ученик. В конце урока, когда учитель и ученик покидают класс, им предлагается по желанию оценить качество пройденного урока по пятибальной шкале. Оценки мы записываем в таблицу quality.*

### Исходные данные

В архиве содержится четыре файла с выгрузкой строк из базы.

Файл **users.txt** хранит информацию о пользователях:

- id – уникальный идентификатор пользователя
- role – указывает, является ли пользователь учеником (pupil) или учителем (tutor)

Файл **lessons.txt** содержит следующие поля:

- id – уникальный идентификатор урока
- event_id – идентификатор, связывающий уроки с файлом participants. У нескольких уроков может быть один и тот же event_id
- subject – предмет урока, строка
- scheduled_time – время начала урока, в формате ГГГГ-ММ-ДД чч:мм:сс (иногда есть еще миллисекунды). Время указано в UTC

Файл **participants.txt** позволяет связать урок с его участниками. Он содержит следующие поля:

- user_id – идентификатор пользователя (указывает на запись в файле users.txt)
- event_id – идентификатор, связывающий урок с участником. Чтобы понять, какие пользователи были на уроке Х, нужно найти в файле participants.txt строки, у которых event_id совпадает с event_id урока Х.

Файл **quality.txt** содержит следующие поля:

- lesson_id – идентификатор урока, указывающий на запись в таблице lessons.txt. У нескольких строчек из этого файла может быть один и тот же lesson_id, потому что оценок за урок может быть несколько (в случае, когда и ученик, и репетитор оценили качество урока)
- tech_quality – оценка качества урока. Это число от 1 до 5. Иногда его может не быть, если пользователь не выставил оценку.

### Задача

Нужно найти, какой из репетиторов получал самую низкую среднюю оценку качества после уроков по физике за каждый день, и вывести эту оценку.

Примечания:

- Необходимо учитывать оценки и учителей, и учеников.
- Нужно учитывать только тех учителей, за уроки по физике которых в этот день стоит хотя бы одна оценка.
- Начало урока для решения задачи должно учитываться по московскому времени.
- При расчёте среднего значения не нужно учитывать ситуации, когда пользователь не выставил оценку.
- Если у нескольких учителей после расчёта совпадают средние значения, можно вывести любого из них.

## Задание 1: Имена

In [1]:
# Загрузим библиотеки
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', -1)
import numpy as np

In [2]:
# Сохраним файл в перменную df

df = pd.read_csv('names_new.txt',header=None)

# Переименуем столбец с именами в "name"

df.columns=['name']

# Выведем таблицу
df.head()

        name
0  MARY
1  PATRICIA
2  LINDA
3  BARBARA
4  ELIZABETH

In [3]:
#Проверим на пропущенные значения
df.isnull().sum()

name    1
dtype: int64

In [4]:
df = df.dropna()
df.isnull().sum()

name    0
dtype: int64

In [5]:
df = df.sort_values('name')
df.head()

       name
2700  AARON
1582  ABBEY
1040  ABBIE
693   ABBY
4841  ABDUL

In [6]:
# Начнем индекс с 1
df= df.reset_index()

df.index = df.index + 1

# Посмотрим на результаты
df.head()

   index   name
1  2700   AARON
2  1582   ABBEY
3  1040   ABBIE
4  693    ABBY
5  4841   ABDUL

In [7]:
names = df['name']
alphabet = dict([tuple(reversed(i)) for i in enumerate('ABCDEFGHIJKLMNOPQRSTUWVXYZ', 1)]);
def func(name):
    s = sum([alphabet[l] for l in name])
    return s

In [8]:
# Создадим столбец "sum_alf" где будет храниться сумма порядковых номеров алфавита для каждого имени
df['sum_alf']=df['name'].apply(func)
df.head()

   index   name  sum_alf
1  2700   AARON  49
2  1582   ABBEY  35
3  1040   ABBIE  19
4  693    ABBY   30
5  4841   ABDUL  40

In [9]:
# Создадим столбец "sum_alf*i" где будет храниться произведение sum_alf и индекса
df['sum_alf*i']= df['sum_alf']*df.index
df.head()

   index   name  sum_alf  sum_alf*i
1  2700   AARON  49       49
2  1582   ABBEY  35       70
3  1040   ABBIE  19       57
4  693    ABBY   30       120
5  4841   ABDUL  40       200

In [10]:
df['sum_alf*i'].sum()

872141665

## Задание 2: IP-адреса

In [11]:
# Загрузим файл hits.txt
df_hits = pd.read_csv('hits.txt',sep='\t',header=None)
# переименуем столбцы
df_hits.columns = ['site','ip','unknown)']
# Выведем таблицу
df_hits.head()

,site,ip,unknown)
0,https://wikipedia.org,72.110.191.15,/friends/files
1,rambler.ru,142.93.168.247,/universe.php
2,ftp://info.itar-tass.com,90.68.118.69,/login/monitors/static/me
3,http://altavista.com,18.79.197.236,/friends/tasks/universe
4,ftp://tetrika-school.ru,115.26.250.226,/translate/anekdots/my-files/monday

In [12]:
# Выведем топ-5 по количеству повторений
df_hits['ip'].value_counts().head()

154.157.157.156    1531
82.146.232.163     1505
226.247.119.128    1494
194.78.107.33      1494
21.143.243.182     1479
Name: ip, dtype: int64

## Задание 3: Оценка уроков

In [13]:
# Загрузим и выведем таблицу lessons

lessons = pd.read_csv('lessons.txt',sep='|')

# Удалим строку с индексом '0' - она не несет никакой информации

lessons.drop([0,0], inplace=True)
lessons.drop([1,379], inplace=True)

# Выведем таблицу
lessons.head()

,id,event_id,subject,scheduled_time
2,6d8e59d9-a7c8-4bb3-8ff3-99cd07acdf1a,51568.0,it,2020-01-19 13:00:00
3,62e1a078-33de-47c1-99d2-845b1daca56f,52790.0,hist,2020-01-19 13:00:00
4,00fc6685-f53a-49bb-b960-5e0042fd3852,51341.0,phys,2020-01-17 12:00:00
5,4cadf623-82e6-422f-a342-acf978302fb2,55048.0,phys,2020-01-19 14:00:00
6,f3f15fee-ad91-429c-8b1e-faeb42f78f58,50760.0,it,2020-01-19 15:00:00

In [14]:
lessons.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 377 entries, 2 to 378
Data columns (total 4 columns):
                  id                      377 non-null object
 event_id                                 377 non-null float64
 subject                                  377 non-null object
       scheduled_time                     377 non-null object
dtypes: float64(1), object(3)
memory usage: 14.7+ KB

In [15]:
# Заменим названия столбцов
lessons.columns=['id','event_id','subject','scheduled_time']

In [16]:
# Проверим на дубликаты
lessons.duplicated().sum()

0

In [17]:
# Проверим на пропущенные значения
lessons.isnull().sum()

id                0
event_id          0
subject           0
scheduled_time    0
dtype: int64

In [18]:
lessons['event_id']=lessons['event_id'].astype('int')

In [19]:
lessons['subject'].unique()

array([' it      ', ' hist    ', ' phys    ', ' bio     '], dtype=object)

In [20]:
lessons = lessons.applymap(lambda x: str(x).strip())

In [21]:
lessons['subject'].unique()

array(['it', 'hist', 'phys', 'bio'], dtype=object)

In [22]:
lessons.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 377 entries, 2 to 378
Data columns (total 4 columns):
id                377 non-null object
event_id          377 non-null object
subject           377 non-null object
scheduled_time    377 non-null object
dtypes: object(4)
memory usage: 14.7+ KB

In [23]:
# Загрузим и выведем таблицу 'test'

quality = pd.read_csv('quality.txt',sep='|')

# Удалим строку с индексом '0' - она не несет никакой информации

quality.drop([0,4], inplace=True)
quality.drop([1,366], inplace=True)


# Выведем таблицу
quality.head()

                 lesson_id                 tech_quality
2   62e1a078-33de-47c1-99d2-845b1daca56f               5
3   62e1a078-33de-47c1-99d2-845b1daca56f               5
5   00fc6685-f53a-49bb-b960-5e0042fd3852               5
6   4cadf623-82e6-422f-a342-acf978302fb2               5
7   e597a79a-3f68-4d15-bc77-c7000bcf8e52               5

In [24]:
quality.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 363 entries, 2 to 365
Data columns (total 2 columns):
              lesson_id                   363 non-null object
 tech_quality                             363 non-null object
dtypes: object(2)
memory usage: 8.5+ KB

In [25]:
# Заменим названия столбцов

quality.columns= ['lesson_id','tech_quality']

In [26]:
# Проверим на дубликаты

quality.duplicated().sum()

85

In [27]:
# Проверим на пропущенные значения
quality.isnull().sum()

lesson_id       0
tech_quality    0
dtype: int64

In [28]:
# Проверим, как записаны оценки
quality['tech_quality'].unique()

array(['            5', '            2', '            4', '             ',
       '            3', '            1'], dtype=object)

In [29]:
# Удалим пробелы в оценках
quality = quality.applymap(lambda x: str(x).strip())
# Назначим Nan вместо пробелов
quality=quality.replace(r'^\s*$', np.nan, regex=True)
# Выполним проверку
quality['tech_quality'].unique()

array(['5', '2', '4', nan, '3', '1'], dtype=object)

In [30]:
# Проверим на пропущенные значения
quality.isnull().sum()

lesson_id       0
tech_quality    16
dtype: int64

In [31]:
# Заменим Nan на медианную оценку
quality = quality.fillna(quality['tech_quality'].median())
# Проверим еще раз на пропуски
quality.isnull().sum()

lesson_id       0
tech_quality    0
dtype: int64

In [32]:
# Проверим еще раз какие оценки в нашем датафрейме
quality['tech_quality'].unique()

array(['5', '2', '4', 5.0, '3', '1'], dtype=object)

In [33]:
quality['tech_quality']=quality['tech_quality'].astype('int')

In [34]:
quality= quality.groupby('lesson_id').agg({'tech_quality':'mean'})
quality.reset_index().head()

                              lesson_id  tech_quality
0  00fc6685-f53a-49bb-b960-5e0042fd3852  5.0
1  01f717d8-baaf-427d-a927-08c79713ae79  3.5
2  024d415a-4543-4e73-88c6-f4609e1bf1ed  4.5
3  03f4f4a8-c60c-41d7-a1cb-17b2d36ee183  5.0
4  056c3d91-dce7-4071-91d3-1de816ee63a3  4.5

In [35]:
# Загрузим и выведем таблицу 'participants'

participants = pd.read_csv('participants.txt',sep='|')

# Удалим строку с индексом '0' - она не несет никакой информации

participants.drop([0,4], inplace=True)
participants.drop([1,744], inplace=True)
# Выведем таблицу

participants.head()

    event_id                 user_id
2      38114    4df2832a-1d63-4453-9659-43993fc35996
3      51568    bb1c0bc8-1212-452b-97a0-439d4a2169e2
5      52790    a1323b68-c82c-429a-8e2c-65597e648c1a
6      52790    e866fbd8-a46b-4431-9e19-f0966981f6c9
7      51341    4ab072ed-8a41-4ed6-9877-8f1d1fbb24d2

In [36]:
participants.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 741 entries, 2 to 743
Data columns (total 2 columns):
 event_id                                 741 non-null object
               user_id                    741 non-null object
dtypes: object(2)
memory usage: 17.4+ KB

In [37]:
participants.columns=['event_id','id']

In [38]:
participants['event_id'] = participants['event_id'].astype('int')

In [39]:
# Загрузим и выведем таблицу 'participants'

users = pd.read_csv('users.txt',sep='|')

# Удалим строку с индексом '0' - она не несет никакой информации

users.drop([0,4], inplace=True)
users.drop([1,744], inplace=True)

# Выведем таблицу
users.head()

                     id                    role
2   4df2832a-1d63-4453-9659-43993fc35996    tutor
3   bb1c0bc8-1212-452b-97a0-439d4a2169e2    pupil
5   a1323b68-c82c-429a-8e2c-65597e648c1a    tutor
6   e866fbd8-a46b-4431-9e19-f0966981f6c9    pupil
7   4ab072ed-8a41-4ed6-9877-8f1d1fbb24d2    pupil

In [40]:
# Посмотрим в каком формате зранятся данные 
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 741 entries, 2 to 743
Data columns (total 2 columns):
                  id                      741 non-null object
 role                                     741 non-null object
dtypes: object(2)
memory usage: 17.4+ KB

In [41]:
users.isnull().sum()

                  id                      0
 role                                     0
dtype: int64

In [42]:
users.columns=['id','role']
users.head()

                                       id    role
2   4df2832a-1d63-4453-9659-43993fc35996    tutor
3   bb1c0bc8-1212-452b-97a0-439d4a2169e2    pupil
5   a1323b68-c82c-429a-8e2c-65597e648c1a    tutor
6   e866fbd8-a46b-4431-9e19-f0966981f6c9    pupil
7   4ab072ed-8a41-4ed6-9877-8f1d1fbb24d2    pupil

In [43]:
#Проверим, правильно ли записаны значения 
users['role'].unique()

array([' tutor', ' pupil', ' admin'], dtype=object)

In [44]:
# Уберем пробелы из названий
users = users.applymap(lambda x: str(x).strip())

In [45]:
#Проверим
users['role'].unique()

array(['tutor', 'pupil', 'admin'], dtype=object)

In [46]:
# Оставим в users только учителей и назовем датафрейм pupil
tutor = users[users['role']== 'tutor']
tutor.head()

                                      id   role
2   4df2832a-1d63-4453-9659-43993fc35996  tutor
5   a1323b68-c82c-429a-8e2c-65597e648c1a  tutor
8   30a19496-bdaf-461c-abbc-2709ae520201  tutor
9   43efce48-94b2-4412-857f-223d45969008  tutor
11  63441abe-c4da-4275-ba26-66f7dbd65dde  tutor

In [47]:
score1=tutor.merge(participants,on='id',how='right')
score1.head()

                                      id role  event_id
0   4df2832a-1d63-4453-9659-43993fc35996  NaN  38114
1   4df2832a-1d63-4453-9659-43993fc35996  NaN  38111
2   4df2832a-1d63-4453-9659-43993fc35996  NaN  56195
3   4df2832a-1d63-4453-9659-43993fc35996  NaN  50880
4   4df2832a-1d63-4453-9659-43993fc35996  NaN  38114

In [48]:
lessons['event_id'] = lessons['event_id'].astype('int')

In [49]:
score2= score1.merge(lessons,on='event_id',how='left')
score2.head()

,id_x,role,event_id,id_y,subject,scheduled_time
0,4df2832a-1d63-4453-9659-43993fc35996,NaN,38114,2e3b1173-7edb-4737-9500-a23d7b852518,phys,2020-01-12 12:00:00
1,4df2832a-1d63-4453-9659-43993fc35996,NaN,38111,0e30fdbd-2af7-40c7-8f38-336c9d8512f3,phys,2020-01-11 12:00:00
2,4df2832a-1d63-4453-9659-43993fc35996,NaN,56195,06277d4e-db4a-4fa0-b9f8-b1063088ad75,phys,2020-01-20 14:00:00
3,4df2832a-1d63-4453-9659-43993fc35996,NaN,50880,883e272f-c15b-4bf7-8066-f4a8e1862249,phys,2020-01-12 09:30:00
4,4df2832a-1d63-4453-9659-43993fc35996,NaN,50880,160d0426-867c-4d68-9bf5-85c75e2ecbf2,phys,2020-01-19 09:30:00

In [50]:
score2.columns=['id_tutor','role','event_id','lesson_id','sub','scheduled_time']
del score2['role']
score2= score2[score2['sub']== 'phys']
score2.head()

,id_tutor,event_id,lesson_id,sub,scheduled_time
0,4df2832a-1d63-4453-9659-43993fc35996,38114,2e3b1173-7edb-4737-9500-a23d7b852518,phys,2020-01-12 12:00:00
1,4df2832a-1d63-4453-9659-43993fc35996,38111,0e30fdbd-2af7-40c7-8f38-336c9d8512f3,phys,2020-01-11 12:00:00
2,4df2832a-1d63-4453-9659-43993fc35996,56195,06277d4e-db4a-4fa0-b9f8-b1063088ad75,phys,2020-01-20 14:00:00
3,4df2832a-1d63-4453-9659-43993fc35996,50880,883e272f-c15b-4bf7-8066-f4a8e1862249,phys,2020-01-12 09:30:00
4,4df2832a-1d63-4453-9659-43993fc35996,50880,160d0426-867c-4d68-9bf5-85c75e2ecbf2,phys,2020-01-19 09:30:00

In [51]:
score3=score2.merge(quality,on='lesson_id',how='left')
score3.head()

,id_tutor,event_id,lesson_id,sub,scheduled_time,tech_quality
0,4df2832a-1d63-4453-9659-43993fc35996,38114,2e3b1173-7edb-4737-9500-a23d7b852518,phys,2020-01-12 12:00:00,5.0
1,4df2832a-1d63-4453-9659-43993fc35996,38111,0e30fdbd-2af7-40c7-8f38-336c9d8512f3,phys,2020-01-11 12:00:00,NaN
2,4df2832a-1d63-4453-9659-43993fc35996,56195,06277d4e-db4a-4fa0-b9f8-b1063088ad75,phys,2020-01-20 14:00:00,NaN
3,4df2832a-1d63-4453-9659-43993fc35996,50880,883e272f-c15b-4bf7-8066-f4a8e1862249,phys,2020-01-12 09:30:00,5.0
4,4df2832a-1d63-4453-9659-43993fc35996,50880,160d0426-867c-4d68-9bf5-85c75e2ecbf2,phys,2020-01-19 09:30:00,5.0

In [52]:
score3.sort_values('tech_quality').head()

,id_tutor,event_id,lesson_id,sub,scheduled_time,tech_quality
57,43efce48-94b2-4412-857f-223d45969008,52949,577ae94d-45c8-4804-9a50-40e91048d81d,phys,2020-01-18 09:00:00,2.0
208,9d9029a2-c81a-49f7-84ee-7696eecd2f99,52949,577ae94d-45c8-4804-9a50-40e91048d81d,phys,2020-01-18 09:00:00,2.0
356,f2f25148-97cb-422d-a5b5-b0dabbca0523,38199,69131767-f538-4305-ad4d-2f854f64e210,phys,2020-01-11 15:00:00,3.0
100,8fe03f08-8581-430c-a590-9888ab36deb3,38199,69131767-f538-4305-ad4d-2f854f64e210,phys,2020-01-11 15:00:00,3.0
354,f2f25148-97cb-422d-a5b5-b0dabbca0523,38199,69131767-f538-4305-ad4d-2f854f64e210,phys,2020-01-11 15:00:00,3.0